spec/support/vcr_cassettes/preneeds/pre_need_applications/creates_a_pre_need_application.yml

---
http_interactions:
- request:
    method: post
    uri: "<PRENEEDS_HOST>/eoas_SOA/PreNeedApplicationPort"
    body:
      encoding: UTF-8
      string: <?xml version="1.0" encoding="UTF-8"?><env:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema"
        xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:tns="http://service.soa.eoas.cem.va.gov/"
        xmlns:env="http://schemas.xmlsoap.org/soap/envelope/"><env:Body><tns:receivePreNeedApplication><preNeedRequest><applicant><applicantEmail>hg@hotmail.com</applicantEmail><applicantPhoneNumber>555-555-5555
        - 234</applicantPhoneNumber><applicantRelationshipToClaimant>Self</applicantRelationshipToClaimant><completingReason>I
        don&#39;t know</completingReason><mailingAddress><address1>108 West 51st Street</address1><city>NY</city><countryCode>US</countryCode><postalZip>10000</postalZip><state>NY</state></mailingAddress><name><firstName>first_name166</firstName><lastName>last_name166</lastName></name></applicant><applicationStatus></applicationStatus><claimant><address><address1>109
        West 51st Street</address1><city>NY</city><countryCode>US</countryCode><postalZip>10000</postalZip><state>NY</state></address><dateOfBirth>2001-01-31</dateOfBirth><desiredCemetery>400</desiredCemetery><name><firstName>first_name167</firstName><lastName>last_name167</lastName></name><relationshipToVet>1</relationshipToVet><ssn>123-45-6789</ssn></claimant><currentlyBuriedPersons><cemeteryNumber>400</cemeteryNumber><name><firstName>first_name168</firstName><lastName>last_name168</lastName></name></currentlyBuriedPersons><hasAttachments>false</hasAttachments><hasCurrentlyBuried>1</hasCurrentlyBuried><sendingApplication>vets.gov</sendingApplication><sendingCode></sendingCode><sentTime>2017-07-03T18:11:13Z</sentTime><trackingNumber>AaIXazpumsKcMxEmMeVG</trackingNumber><veteran><address><address1>110
        West 51st Street</address1><city>NY</city><countryCode>US</countryCode><postalZip>10000</postalZip><state>NY</state></address><currentName><firstName>first_name169</firstName><lastName>last_name169</lastName></currentName><gender>Male</gender><isDeceased>unsure</isDeceased><maritalStatus>Married</maritalStatus><militaryServiceNumber>123456789</militaryServiceNumber><serviceName><firstName>first_name170</firstName><lastName>last_name170</lastName></serviceName><serviceRecords><branchOfService>AF</branchOfService><dischargeType>1</dischargeType></serviceRecords><ssn>123-45-6789</ssn><vaClaimNumber>123456789</vaClaimNumber><militaryStatus>A</militaryStatus></veteran></preNeedRequest></tns:receivePreNeedApplication></env:Body></env:Envelope>
    headers:
      Accept:
      - text/xml;charset=UTF-8
      Content-Type:
      - text/xml;charset=UTF-8
      User-Agent:
      - Vets.gov Agent
      Date:
      - Mon, 03 Jul 2017 18:11:13 GMT
      Content-Length:
      - '2436'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Mon, 03 Jul 2017 18:11:28 GMT
      Transfer-Encoding:
      - chunked
      Content-Type:
      - multipart/related;start="<rootpart*9de1a428-b3b6-4806-b176-5d8d6405c2a2@example.jaxws.sun.com>";type="application/xop+xml";boundary="uuid:9de1a428-b3b6-4806-b176-5d8d6405c2a2";start-info="text/xml"
    body:
      encoding: UTF-8
      string: "--uuid:9de1a428-b3b6-4806-b176-5d8d6405c2a2\r\nContent-Id: <rootpart*9de1a428-b3b6-4806-b176-5d8d6405c2a2@example.jaxws.sun.com>\r\nContent-Type:
        application/xop+xml;charset=utf-8;type=\"text/xml\"\r\nContent-Transfer-Encoding:
        binary\r\n\r\n<?xml version='1.0' encoding='UTF-8'?><S:Envelope xmlns:S=\"http://schemas.xmlsoap.org/soap/envelope/\"><S:Body><ns2:receivePreNeedApplicationResponse
        xmlns:ns2=\"http://service.soa.eoas.cem.va.gov/\"><return><applicationUUID>1b1bea3b-8b1d-4331-9222-f1fc2441500d</applicationUUID><returnCode>200</returnCode><returnDescription>PreNeed
        Application received.</returnDescription></return></ns2:receivePreNeedApplicationResponse></S:Body></S:Envelope>\r\n--uuid:9de1a428-b3b6-4806-b176-5d8d6405c2a2--"
    http_version: 
  recorded_at: Mon, 03 Jul 2017 18:11:13 GMT
recorded_with: VCR 3.0.3
